"""
Python的元组与列表类似，不同之处在于元组的元素不能修改。

元组使用小括号，列表使用方括号。

元组创建很简单，只需要在括号中添加元素，并使用逗号隔开即可。

"""

tup1 = ('physics', 'chemistry', 1997, 2000)
tup2 = (1, 2, 3, 4, 5)
tup3 = "a", "b", "c", "d"

# 创建空元组
tup4 = ()


# 元组中只包含一个元素时，需要在元素后面添加逗号
tup5 = (50,)

# ################### 访问元组 ###################
print("tup1[0]: ", tup1[0])
print("tup2[1:5]: ", tup2[1:5])

# ################### 修改元组 ###################
"""
元组中的元素值是不允许修改的，但我们可以对元组进行连接组合
"""


# ################### 删除元组 ####################

# ################### 元组运算符 ##################

# ################### 元组索引，截取 ###############

# ################### 无关闭分隔符 #################

# ################### 元组内置函数 #################


